{
  "metadataVersion": "1.0.0",
  "genre": "arcade",
  "description": "Classic Snake game where the player controls a snake that grows longer by eating food. The game ends if the snake hits walls or itself.",
  "expectedControls": "Use Arrow Keys, WASD, or virtual D-pad to move the snake",
  "inputSchema": {
    "type": "javascript",
    "content": "gameBuilder.createAxis2D('Move').bindWASD().bindArrowKeys().bindVirtualDPad('#dpad')",
    "axes": [
      {
        "name": "Move",
        "keys": ["w", "a", "s", "d", "ArrowUp", "ArrowDown", "ArrowLeft", "ArrowRight"],
        "description": "Control snake movement direction (2D axis)",
        "is2D": true
      }
    ]
  },
  "loadingIndicators": [
    {
      "type": "element",
      "pattern": "#start-btn",
      "description": "Start button appears when game is ready"
    },
    {
      "type": "text",
      "pattern": "SNAKE",
      "description": "Game title displays on main menu"
    }
  ],
  "successIndicators": [
    {
      "type": "score_change",
      "description": "Score should increment when snake eats food",
      "selector": "#score"
    },
    {
      "type": "animation",
      "description": "Snake should move across the play area"
    },
    {
      "type": "element_visible",
      "description": "Snake head and body segments should be visible",
      "selector": "canvas"
    },
    {
      "type": "element_visible",
      "description": "Food should be visible on the play area",
      "selector": "canvas"
    }
  ],
  "testingStrategy": {
    "waitBeforeInteraction": 2000,
    "interactionDuration": 30000,
    "criticalAxes": ["Move"],
    "instructions": "This is a DOM-based Snake game. The game uses standard HTML elements or canvas for rendering. After loading, look for a Start button and click it to begin. Once started, use Arrow keys (ArrowUp, ArrowDown, ArrowLeft, ArrowRight) or WASD keys to change the snake's direction. The snake should move continuously in the current direction and turn when you press a directional key. Try all four directions to verify responsive controls. Look for food items on the screen - when the snake eats food, it should grow longer and the score should increase. Play for about 30 seconds, testing all four directions and trying to eat at least one food item. Success indicators: snake moves continuously, direction changes work, snake grows when eating food, score increments, no console errors. Avoid running into walls or the snake's own body as this typically ends the game."
  }
}
